skate/0.org/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 200;

boundaryField
{
    "(slip_wall|human.*)"
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength   3.0;       // 1cm - half channel height
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue     $internalField;
        value           $internalField;
    }
    defaultFaces
    {
        type            empty;
    }
    "round.*"
    {
        type            overset;
    }
}

// ************************************************************************* //
