skate/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    human
    {
        type            wall;
        nFaces          128;
        startFace       46983;
    }
    human2
    {
        type            wall;
        nFaces          128;
        startFace       47111;
    }
    inlet
    {
        type            patch;
        nFaces          90;
        startFace       47239;
    }
    outlet
    {
        type            patch;
        nFaces          90;
        startFace       47329;
    }
    slip_wall
    {
        type            wall;
        nFaces          470;
        startFace       47419;
    }
    defaultFaces
    {
        type            empty;
        nFaces          47436;
        startFace       47889;
    }
)

// ************************************************************************* //
