skate/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
    inlet
    {
        type            patch;
    }
    outlet
    {
        type            patch;
    }
    slip_wall
    {
        type            wall;
    }
    defaultFaces
    {
        type            empty;
    }
    "human.*"
    {
        type            wall;
    }
    "round.*"
    {
        type            overset;
    }
}

// ************************************************************************* //
