skate/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            ("libmyfvMotionSolvers.so");

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.1;

deltaT          0.0001;

//writeControl    timeStep;
//writeInterval   10;

writeControl    adjustableRunTime;
writeInterval   0.01;

purgeWrite      1;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.2;

functions
{
    forceCoeffs
    {
        type        forceCoeffs;
        libs        ("libforces.so");
        writeControl    writeTime;
        patches         (human);
        rho              rhoInf;
        log              yes;
        rhoInf           1;
        CofR             (0 0 0);
        liftDir     (1 0 0);
        dragDir     (0 1 0);
        pitchAxis   (0 0 1);
        magUInf     10;
        lRef        0.82;
        Aref        0.253372;
    }
    forceCoeffs2
    {
        type        forceCoeffs;
        libs        ("libforces.so");
        writeControl    writeTime;
        patches         (human2);
        rho              rhoInf;
        log              yes;
        rhoInf           1;
        CofR             (0 0 0);
        liftDir     (1 0 0);
        dragDir     (0 1 0);
        pitchAxis   (0 0 1);
        magUInf     10;
        lRef        0.82;
        Aref        0.253372;
    }
};
// ************************************************************************* //
