skate/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    rink;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-1e5 -1e5 -1e5) (1e5 1e5 1e5);
    }
    {
        name    rinkZone;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     rink;           // name of cellSet
    }
);

// ************************************************************************* //
